zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE315/startup_MCXE315.c

//*****************************************************************************
// MCXE315 startup code
//
// Version : 070826
//*****************************************************************************
//
// Copyright 2016-2026 NXP
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************
#include <stdint.h>

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC push_options
#pragma GCC optimize("Og")
#endif
#endif // DEBUG

#if defined(__cplusplus)
#if defined(__MCUXPRESSO)
#ifdef __REDLIB__
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
    extern void __libc_init_array(void);
}
#endif // __REDLIB__
#endif // __MCUXPRESSO
#endif // __cplusplus

#define WEAK __attribute__ ((weak))
#if defined(__MCUXPRESSO)
#define WEAK_AV __attribute__ ((weak, section(".after_vectors")))
#else
#define WEAK_AV __attribute__ ((weak))
#endif // __MCUXPRESSO
#define ALIAS(f) __attribute__ ((weak, alias (#f)))

//*****************************************************************************
#if defined(__cplusplus)
extern "C" {
#endif

//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
extern void SystemInit(void);

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
#if defined(__MCUXPRESSO)
void ResetISR(void);
#else
void Reset_Handler(void);
#endif // __MCUXPRESSO
void Reset_Handler_C(void);
WEAK void NMI_Handler(void);
WEAK void HardFault_Handler(void);
WEAK void MemManage_Handler(void);
WEAK void BusFault_Handler(void);
WEAK void UsageFault_Handler(void);
WEAK void SVC_Handler(void);
WEAK void DebugMon_Handler(void);
WEAK void PendSV_Handler(void);
WEAK void SysTick_Handler(void);
WEAK void DefaultISR(void);
WEAK void DefaultISR1(uint32_t instance);
WEAK void DefaultISR3(uint32_t instance, uint32_t start, uint32_t end);
WEAK void DefaultISR4(uint32_t instance, uint32_t start, uint32_t end, uint32_t type);

//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
WEAK void Reserved16_IRQHandler(void);
WEAK void Reserved17_IRQHandler(void);
WEAK void Reserved18_IRQHandler(void);
WEAK void Reserved19_IRQHandler(void);
WEAK void DMATCD0_IRQHandler(void);
WEAK void DMATCD1_IRQHandler(void);
WEAK void DMATCD2_IRQHandler(void);
WEAK void DMATCD3_IRQHandler(void);
WEAK void DMATCD4_IRQHandler(void);
WEAK void DMATCD5_IRQHandler(void);
WEAK void DMATCD6_IRQHandler(void);
WEAK void DMATCD7_IRQHandler(void);
WEAK void DMATCD8_IRQHandler(void);
WEAK void DMATCD9_IRQHandler(void);
WEAK void DMATCD10_IRQHandler(void);
WEAK void DMATCD11_IRQHandler(void);
WEAK void Reserved32_IRQHandler(void);
WEAK void Reserved33_IRQHandler(void);
WEAK void Reserved34_IRQHandler(void);
WEAK void Reserved35_IRQHandler(void);
WEAK void Reserved36_IRQHandler(void);
WEAK void Reserved37_IRQHandler(void);
WEAK void Reserved38_IRQHandler(void);
WEAK void Reserved39_IRQHandler(void);
WEAK void Reserved40_IRQHandler(void);
WEAK void Reserved41_IRQHandler(void);
WEAK void Reserved42_IRQHandler(void);
WEAK void Reserved43_IRQHandler(void);
WEAK void Reserved44_IRQHandler(void);
WEAK void Reserved45_IRQHandler(void);
WEAK void Reserved46_IRQHandler(void);
WEAK void Reserved47_IRQHandler(void);
WEAK void Reserved48_IRQHandler(void);
WEAK void Reserved49_IRQHandler(void);
WEAK void Reserved50_IRQHandler(void);
WEAK void Reserved51_IRQHandler(void);
WEAK void ERM_0_IRQHandler(void);
WEAK void ERM_1_IRQHandler(void);
WEAK void MCM_IRQHandler(void);
WEAK void STM0_IRQHandler(void);
WEAK void Reserved56_IRQHandler(void);
WEAK void Reserved57_IRQHandler(void);
WEAK void SWT0_IRQHandler(void);
WEAK void Reserved59_IRQHandler(void);
WEAK void Reserved60_IRQHandler(void);
WEAK void CTI_INT0_IRQHandler(void);
WEAK void CTI_INT1_IRQHandler(void);
WEAK void Reserved63_IRQHandler(void);
WEAK void FLASH_0_IRQHandler(void);
WEAK void FLASH_1_IRQHandler(void);
WEAK void FLASH_2_IRQHandler(void);
WEAK void RGM_IRQHandler(void);
WEAK void PMC_IRQHandler(void);
WEAK void SIUL2_0_IRQHandler(void);
WEAK void SIUL2_1_IRQHandler(void);
WEAK void SIUL2_2_IRQHandler(void);
WEAK void SIUL2_3_IRQHandler(void);
WEAK void Reserved73_IRQHandler(void);
WEAK void Reserved74_IRQHandler(void);
WEAK void Reserved75_IRQHandler(void);
WEAK void Reserved76_IRQHandler(void);
WEAK void EMIOS0_2_IRQHandler(void);
WEAK void EMIOS0_3_IRQHandler(void);
WEAK void EMIOS0_4_IRQHandler(void);
WEAK void EMIOS0_5_IRQHandler(void);
WEAK void EMIOS0_6_IRQHandler(void);
WEAK void EMIOS0_7_IRQHandler(void);
WEAK void Reserved83_IRQHandler(void);
WEAK void Reserved84_IRQHandler(void);
WEAK void EMIOS1_2_IRQHandler(void);
WEAK void EMIOS1_3_IRQHandler(void);
WEAK void EMIOS1_4_IRQHandler(void);
WEAK void EMIOS1_5_IRQHandler(void);
WEAK void EMIOS1_6_IRQHandler(void);
WEAK void EMIOS1_7_IRQHandler(void);
WEAK void Reserved91_IRQHandler(void);
WEAK void Reserved92_IRQHandler(void);
WEAK void Reserved93_IRQHandler(void);
WEAK void Reserved94_IRQHandler(void);
WEAK void Reserved95_IRQHandler(void);
WEAK void Reserved96_IRQHandler(void);
WEAK void Reserved97_IRQHandler(void);
WEAK void Reserved98_IRQHandler(void);
WEAK void WKPU_IRQHandler(void);
WEAK void CMU0_IRQHandler(void);
WEAK void CMU1_IRQHandler(void);
WEAK void CMU2_IRQHandler(void);
WEAK void BCTU_IRQHandler(void);
WEAK void Reserved104_IRQHandler(void);
WEAK void Reserved105_IRQHandler(void);
WEAK void Reserved106_IRQHandler(void);
WEAK void Reserved107_IRQHandler(void);
WEAK void LCU0_IRQHandler(void);
WEAK void LCU1_IRQHandler(void);
WEAK void Reserved110_IRQHandler(void);
WEAK void Reserved111_IRQHandler(void);
WEAK void PIT0_IRQHandler(void);
WEAK void PIT1_IRQHandler(void);
WEAK void Reserved114_IRQHandler(void);
WEAK void Reserved115_IRQHandler(void);
WEAK void Reserved116_IRQHandler(void);
WEAK void Reserved117_IRQHandler(void);
WEAK void RTC_IRQHandler(void);
WEAK void Reserved119_IRQHandler(void);
WEAK void Reserved120_IRQHandler(void);
WEAK void Reserved121_IRQHandler(void);
WEAK void Reserved122_IRQHandler(void);
WEAK void Reserved123_IRQHandler(void);
WEAK void Reserved124_IRQHandler(void);
WEAK void FlexCAN0_0_IRQHandler(void);
WEAK void FlexCAN0_1_IRQHandler(void);
WEAK void FlexCAN0_2_IRQHandler(void);
WEAK void FlexCAN0_3_IRQHandler(void);
WEAK void FlexCAN1_0_IRQHandler(void);
WEAK void FlexCAN1_1_IRQHandler(void);
WEAK void FlexCAN1_2_IRQHandler(void);
WEAK void FlexCAN2_0_IRQHandler(void);
WEAK void FlexCAN2_1_IRQHandler(void);
WEAK void FlexCAN2_2_IRQHandler(void);
WEAK void Reserved135_IRQHandler(void);
WEAK void Reserved136_IRQHandler(void);
WEAK void Reserved137_IRQHandler(void);
WEAK void Reserved138_IRQHandler(void);
WEAK void Reserved139_IRQHandler(void);
WEAK void Reserved140_IRQHandler(void);
WEAK void Reserved141_IRQHandler(void);
WEAK void Reserved142_IRQHandler(void);
WEAK void Reserved143_IRQHandler(void);
WEAK void Reserved144_IRQHandler(void);
WEAK void Reserved145_IRQHandler(void);
WEAK void Reserved146_IRQHandler(void);
WEAK void Reserved147_IRQHandler(void);
WEAK void Reserved148_IRQHandler(void);
WEAK void Reserved149_IRQHandler(void);
WEAK void Reserved150_IRQHandler(void);
WEAK void Reserved151_IRQHandler(void);
WEAK void Reserved152_IRQHandler(void);
WEAK void Reserved153_IRQHandler(void);
WEAK void Reserved154_IRQHandler(void);
WEAK void FLEXIO_IRQHandler(void);
WEAK void Reserved156_IRQHandler(void);
WEAK void LPUART_0_IRQHandler(void);
WEAK void LPUART_1_IRQHandler(void);
WEAK void LPUART_2_IRQHandler(void);
WEAK void LPUART_3_IRQHandler(void);
WEAK void Reserved161_IRQHandler(void);
WEAK void Reserved162_IRQHandler(void);
WEAK void Reserved163_IRQHandler(void);
WEAK void Reserved164_IRQHandler(void);
WEAK void Reserved165_IRQHandler(void);
WEAK void Reserved166_IRQHandler(void);
WEAK void Reserved167_IRQHandler(void);
WEAK void Reserved168_IRQHandler(void);
WEAK void Reserved169_IRQHandler(void);
WEAK void Reserved170_IRQHandler(void);
WEAK void Reserved171_IRQHandler(void);
WEAK void Reserved172_IRQHandler(void);
WEAK void Reserved173_IRQHandler(void);
WEAK void Reserved174_IRQHandler(void);
WEAK void Reserved175_IRQHandler(void);
WEAK void Reserved176_IRQHandler(void);
WEAK void LPI2C0_IRQHandler(void);
WEAK void LPI2C1_IRQHandler(void);
WEAK void Reserved179_IRQHandler(void);
WEAK void Reserved180_IRQHandler(void);
WEAK void LPSPI0_IRQHandler(void);
WEAK void LPSPI1_IRQHandler(void);
WEAK void LPSPI2_IRQHandler(void);
WEAK void LPSPI3_IRQHandler(void);
WEAK void Reserved185_IRQHandler(void);
WEAK void Reserved186_IRQHandler(void);
WEAK void Reserved187_IRQHandler(void);
WEAK void Reserved188_IRQHandler(void);
WEAK void Reserved189_IRQHandler(void);
WEAK void Reserved190_IRQHandler(void);
WEAK void Reserved191_IRQHandler(void);
WEAK void Reserved192_IRQHandler(void);
WEAK void Reserved193_IRQHandler(void);
WEAK void JDC_IRQHandler(void);
WEAK void Reserved195_IRQHandler(void);
WEAK void ADC0_IRQHandler(void);
WEAK void ADC1_IRQHandler(void);
WEAK void Reserved198_IRQHandler(void);
WEAK void CMP0_IRQHandler(void);
WEAK void Reserved200_IRQHandler(void);
WEAK void Reserved201_IRQHandler(void);
WEAK void Reserved202_IRQHandler(void);
WEAK void Reserved203_IRQHandler(void);
WEAK void Reserved204_IRQHandler(void);
WEAK void FCCU_0_IRQHandler(void);
WEAK void FCCU_1_IRQHandler(void);
WEAK void STCU_IRQHandler(void);
WEAK void MU0_B_TX_IRQHandler(void);
WEAK void MU0_B_RX_IRQHandler(void);
WEAK void MU0_B_IRQHandler(void);
WEAK void MU1_B_TX_IRQHandler(void);
WEAK void MU1_B_RX_IRQHandler(void);
WEAK void MU1_B_IRQHandler(void);
WEAK void Reserved214_IRQHandler(void);
WEAK void Reserved215_IRQHandler(void);
WEAK void Reserved216_IRQHandler(void);
WEAK void Reserved217_IRQHandler(void);
WEAK void Reserved218_IRQHandler(void);
WEAK void Reserved219_IRQHandler(void);
WEAK void Reserved220_IRQHandler(void);
WEAK void Reserved221_IRQHandler(void);
WEAK void Reserved222_IRQHandler(void);
WEAK void Reserved223_IRQHandler(void);
WEAK void Reserved224_IRQHandler(void);
WEAK void Reserved225_IRQHandler(void);
WEAK void Reserved226_IRQHandler(void);
WEAK void Reserved227_IRQHandler(void);
WEAK void PLL_LOL_IRQHandler(void);
WEAK void CORE_CLK_FAIL_IRQHandler(void);
WEAK void Reserved230_IRQHandler(void);
WEAK void AIPS_PLAT_CLK_FAIL_IRQHandler(void);
WEAK void Reserved232_IRQHandler(void);
WEAK void HSE_B_CLK_FAIL_IRQHandler(void);

//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the DefaultISR, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
void Reserved16_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved17_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved18_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved19_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD0_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD1_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD2_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD3_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD4_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD5_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD6_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD7_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD8_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD9_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD10_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD11_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved32_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved33_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved34_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved35_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved36_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved37_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved38_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved39_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved40_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved41_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved42_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved43_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved44_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved45_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved46_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved47_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved48_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved49_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved50_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved51_DriverIRQHandler(void) ALIAS(DefaultISR);
void ERM_0_DriverIRQHandler(void) ALIAS(DefaultISR);
void ERM_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void MCM_DriverIRQHandler(void) ALIAS(DefaultISR);
void STM_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved56_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved57_DriverIRQHandler(void) ALIAS(DefaultISR);
void SWT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved59_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved60_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTI_INT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTI_INT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved63_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLASH_0_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLASH_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLASH_2_DriverIRQHandler(void) ALIAS(DefaultISR);
void RGM_DriverIRQHandler(void) ALIAS(DefaultISR);
void PMC_DriverIRQHandler(void) ALIAS(DefaultISR);
void SIUL2_0_DriverIRQHandler(void) ALIAS(DefaultISR);
void SIUL2_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void SIUL2_2_DriverIRQHandler(void) ALIAS(DefaultISR);
void SIUL2_3_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved73_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved74_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved75_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved76_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS0_2_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS0_3_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS0_4_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS0_5_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS0_6_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS0_7_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved83_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved84_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS1_2_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS1_3_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS1_4_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS1_5_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS1_6_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS1_7_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved91_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved92_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved93_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved94_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved95_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved96_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved97_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved98_DriverIRQHandler(void) ALIAS(DefaultISR);
void WKPU_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMU_FC_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void CMU_FM_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void BCTU_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved104_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved105_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved106_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved107_DriverIRQHandler(void) ALIAS(DefaultISR);
void LCU0_DriverIRQHandler(void) ALIAS(DefaultISR);
void LCU1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved110_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved111_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved114_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved115_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved116_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved117_DriverIRQHandler(void) ALIAS(DefaultISR);
void RTC_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved119_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved120_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved121_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved122_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved123_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved124_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXCAN_DriverDataIRQHandler(uint32_t instance, uint32_t start, uint32_t end) ALIAS(DefaultISR3);
void FLEXCAN_DriverEventIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved135_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved136_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved137_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved138_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved139_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved140_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved141_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved142_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved143_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved144_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved145_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved146_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved147_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved148_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved149_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved150_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved151_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved152_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved153_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved154_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXIO_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved156_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPUART_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved161_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved162_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved163_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved164_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved165_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved166_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved167_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved168_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved169_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved170_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved171_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved172_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved173_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved174_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved175_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved176_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPI2C_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved179_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved180_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPSPI_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved185_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved186_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved187_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved188_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved189_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved190_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved191_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved192_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved193_DriverIRQHandler(void) ALIAS(DefaultISR);
void JDC_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved195_DriverIRQHandler(void) ALIAS(DefaultISR);
void ADC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void ADC1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved198_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMP0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved200_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved201_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved202_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved203_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved204_DriverIRQHandler(void) ALIAS(DefaultISR);
void FCCU_0_DriverIRQHandler(void) ALIAS(DefaultISR);
void FCCU_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void STCU_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU0_B_TX_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU0_B_RX_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU0_B_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU1_B_TX_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU1_B_RX_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU1_B_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved214_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved215_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved216_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved217_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved218_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved219_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved220_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved221_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved222_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved223_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved224_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved225_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved226_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved227_DriverIRQHandler(void) ALIAS(DefaultISR);
void PLL_LOL_DriverIRQHandler(void) ALIAS(DefaultISR);
void CORE_CLK_FAIL_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved230_DriverIRQHandler(void) ALIAS(DefaultISR);
void AIPS_PLAT_CLK_FAIL_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved232_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSE_B_CLK_FAIL_DriverIRQHandler(void) ALIAS(DefaultISR);

