zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE315/startup_MCXE315.c
WEAK void CTI_INT1_IRQHandler(void)
{
    CTI_INT1_DriverIRQHandler();
}

WEAK void Reserved63_IRQHandler(void)
{
    Reserved63_DriverIRQHandler();
}

WEAK void FLASH_0_IRQHandler(void)
{
    FLASH_0_DriverIRQHandler();
}

WEAK void FLASH_1_IRQHandler(void)
{
    FLASH_1_DriverIRQHandler();
}

WEAK void FLASH_2_IRQHandler(void)
{
    FLASH_2_DriverIRQHandler();
}

WEAK void RGM_IRQHandler(void)
{
    RGM_DriverIRQHandler();
}

WEAK void PMC_IRQHandler(void)
{
    PMC_DriverIRQHandler();
}

WEAK void SIUL2_0_IRQHandler(void)
{
    SIUL2_0_DriverIRQHandler();
}

WEAK void SIUL2_1_IRQHandler(void)
{
    SIUL2_1_DriverIRQHandler();
}

WEAK void SIUL2_2_IRQHandler(void)
{
    SIUL2_2_DriverIRQHandler();
}

WEAK void SIUL2_3_IRQHandler(void)
{
    SIUL2_3_DriverIRQHandler();
}

WEAK void Reserved73_IRQHandler(void)
{
    Reserved73_DriverIRQHandler();
}

WEAK void Reserved74_IRQHandler(void)
{
    Reserved74_DriverIRQHandler();
}

WEAK void Reserved75_IRQHandler(void)
{
    Reserved75_DriverIRQHandler();
}

WEAK void Reserved76_IRQHandler(void)
{
    Reserved76_DriverIRQHandler();
}

WEAK void EMIOS0_2_IRQHandler(void)
{
    EMIOS0_2_DriverIRQHandler();
}

WEAK void EMIOS0_3_IRQHandler(void)
{
    EMIOS0_3_DriverIRQHandler();
}

WEAK void EMIOS0_4_IRQHandler(void)
{
    EMIOS0_4_DriverIRQHandler();
}

WEAK void EMIOS0_5_IRQHandler(void)
{
    EMIOS0_5_DriverIRQHandler();
}

WEAK void EMIOS0_6_IRQHandler(void)
{
    EMIOS0_6_DriverIRQHandler();
}

WEAK void EMIOS0_7_IRQHandler(void)
{
    EMIOS0_7_DriverIRQHandler();
}

WEAK void Reserved83_IRQHandler(void)
{
    Reserved83_DriverIRQHandler();
}

WEAK void Reserved84_IRQHandler(void)
{
    Reserved84_DriverIRQHandler();
}

WEAK void EMIOS1_2_IRQHandler(void)
{
    EMIOS1_2_DriverIRQHandler();
}

WEAK void EMIOS1_3_IRQHandler(void)
{
    EMIOS1_3_DriverIRQHandler();
}

WEAK void EMIOS1_4_IRQHandler(void)
{
    EMIOS1_4_DriverIRQHandler();
}

WEAK void EMIOS1_5_IRQHandler(void)
{
    EMIOS1_5_DriverIRQHandler();
}

WEAK void EMIOS1_6_IRQHandler(void)
{
    EMIOS1_6_DriverIRQHandler();
}

WEAK void EMIOS1_7_IRQHandler(void)
{
    EMIOS1_7_DriverIRQHandler();
}

WEAK void Reserved91_IRQHandler(void)
{
    Reserved91_DriverIRQHandler();
}

WEAK void Reserved92_IRQHandler(void)
{
    Reserved92_DriverIRQHandler();
}

WEAK void Reserved93_IRQHandler(void)
{
    Reserved93_DriverIRQHandler();
}

WEAK void Reserved94_IRQHandler(void)
{
    Reserved94_DriverIRQHandler();
}

WEAK void Reserved95_IRQHandler(void)
{
    Reserved95_DriverIRQHandler();
}

WEAK void Reserved96_IRQHandler(void)
{
    Reserved96_DriverIRQHandler();
}

WEAK void Reserved97_IRQHandler(void)
{
    Reserved97_DriverIRQHandler();
}

WEAK void Reserved98_IRQHandler(void)
{
    Reserved98_DriverIRQHandler();
}

WEAK void WKPU_IRQHandler(void)
{
    WKPU_DriverIRQHandler();
}

WEAK void CMU0_IRQHandler(void)
{
    CMU_FC_DriverIRQHandler(0U);
}

WEAK void CMU1_IRQHandler(void)
{
    CMU_FM_DriverIRQHandler(0U);
}

WEAK void CMU2_IRQHandler(void)
{
    CMU_FM_DriverIRQHandler(1U);
}

WEAK void BCTU_IRQHandler(void)
{
    BCTU_DriverIRQHandler();
}

WEAK void Reserved104_IRQHandler(void)
{
    Reserved104_DriverIRQHandler();
}

WEAK void Reserved105_IRQHandler(void)
{
    Reserved105_DriverIRQHandler();
}

WEAK void Reserved106_IRQHandler(void)
{
    Reserved106_DriverIRQHandler();
}

WEAK void Reserved107_IRQHandler(void)
{
    Reserved107_DriverIRQHandler();
}

WEAK void LCU0_IRQHandler(void)
{
    LCU0_DriverIRQHandler();
}

WEAK void LCU1_IRQHandler(void)
{
    LCU1_DriverIRQHandler();
}

WEAK void Reserved110_IRQHandler(void)
{
    Reserved110_DriverIRQHandler();
}

WEAK void Reserved111_IRQHandler(void)
{
    Reserved111_DriverIRQHandler();
}

WEAK void PIT0_IRQHandler(void)
{
    PIT0_DriverIRQHandler();
}

WEAK void PIT1_IRQHandler(void)
{
    PIT1_DriverIRQHandler();
}

WEAK void Reserved114_IRQHandler(void)
{
    Reserved114_DriverIRQHandler();
}

WEAK void Reserved115_IRQHandler(void)
{
    Reserved115_DriverIRQHandler();
}

WEAK void Reserved116_IRQHandler(void)
{
    Reserved116_DriverIRQHandler();
}

WEAK void Reserved117_IRQHandler(void)
{
    Reserved117_DriverIRQHandler();
}

WEAK void RTC_IRQHandler(void)
{
    RTC_DriverIRQHandler();
}

WEAK void Reserved119_IRQHandler(void)
{
    Reserved119_DriverIRQHandler();
}

WEAK void Reserved120_IRQHandler(void)
{
    Reserved120_DriverIRQHandler();
}

WEAK void Reserved121_IRQHandler(void)
{
    Reserved121_DriverIRQHandler();
}

WEAK void Reserved122_IRQHandler(void)
{
    Reserved122_DriverIRQHandler();
}

WEAK void Reserved123_IRQHandler(void)
{
    Reserved123_DriverIRQHandler();
}

WEAK void Reserved124_IRQHandler(void)
{
    Reserved124_DriverIRQHandler();
}

WEAK void FlexCAN0_0_IRQHandler(void)
{
    FLEXCAN_DriverEventIRQHandler(0U);
}

WEAK void FlexCAN0_1_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(0U, 0U, 31U);
}

WEAK void FlexCAN0_2_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(0U, 32U, 63U);
}

WEAK void FlexCAN0_3_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(0U, 64U, 95U);
}

WEAK void FlexCAN1_0_IRQHandler(void)
{
    FLEXCAN_DriverEventIRQHandler(1U);
}

WEAK void FlexCAN1_1_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(1U, 0U, 31U);
}

WEAK void FlexCAN1_2_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(1U, 32U, 63U);
}

WEAK void FlexCAN2_0_IRQHandler(void)
{
    FLEXCAN_DriverEventIRQHandler(2U);
}

WEAK void FlexCAN2_1_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(2U, 0U, 31U);
}

WEAK void FlexCAN2_2_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(2U, 32U, 63U);
}

WEAK void Reserved135_IRQHandler(void)
{
    Reserved135_DriverIRQHandler();
}

WEAK void Reserved136_IRQHandler(void)
{
    Reserved136_DriverIRQHandler();
}

WEAK void Reserved137_IRQHandler(void)
{
    Reserved137_DriverIRQHandler();
}

WEAK void Reserved138_IRQHandler(void)
{
    Reserved138_DriverIRQHandler();
}

WEAK void Reserved139_IRQHandler(void)
{
    Reserved139_DriverIRQHandler();
}

WEAK void Reserved140_IRQHandler(void)
{
    Reserved140_DriverIRQHandler();
}

WEAK void Reserved141_IRQHandler(void)
{
    Reserved141_DriverIRQHandler();
}

